app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @event = Event.find(params[:event_id])
    @comment.event_id = @event.id
    respond_to do |format|
      if @comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("author", "content", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "123"], ["content", "123"], ["event_id", 5], ["created_at", "2015-08-02 14:59:07.599647"], ["updated_at", "2015-08-02 14:59:07.599647"]]