app/controllers/events_controller.rb

  def update_confirmed
    @event = Event.find(params[:event_id])
    user_name_percent = params[:name_percent].split("%")
    @event.confirmed += [user_name_percent]
    if @event.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "events" SET "confirmed" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["confirmed", "---\n- \n"], ["updated_at", "2015-08-01 21:07:55.794315"], ["id", 3]]

  def show
    @comments = @event.comments.order("created_at").reverse_order
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = ?  ORDER BY created_at DESC  [["event_id", 5]]

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "swag"], ["description", "swag"], ["created_at", "2015-08-01 15:59:09.161710"], ["updated_at", "2015-08-01 15:59:09.161710"]]