app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "chriswissmach@gmail.com"], ["created_at", "2015-08-01 02:59:58.170674"], ["updated_at", "2015-08-01 02:59:58.170674"]]