app/views/application/index.html.haml

			.col-sm-6
				%a{href:"#{event_path(Event.last)}"}
					.btn.btn-default{style:"margin-top:20px;width:150px;height:50px;line-height:35px;margin-bottom:20px;"} View event
---
SELECT  "events".* FROM "events"  ORDER BY "events"."id" DESC LIMIT 1